IdeaRS.Connections
BasePlateData.Orientation Property
Compatible with IDEA StatiCa 0.0
 Gets or sets the orientation of the base plate relative to its connected member
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ItemOrientation Orientation { get; set; }
Property Value
Type: ItemOrientation
See Also
Reference
BasePlateData Class
IdeaRS.Connections.Data Namespace